//цикл for з лічильником
for (let k = 5; k < 10; k += 1) {
  console.log(k);
}

//1. запускається цикл for та створюється змінна k в яку ми присвоїли 5.
//2. далі перевіряється умова k < 10, тобто 5 < 10.
//3. якщо в умові true то виконується код у фігурних дужках, тобто "console.log(k)" тобто "console.log(5)".
//4. збільшується ітерація k += 1, тобто k = 5 + 1, тобто k = 6.
//5. далі перевіряється умова k < 10, тобто 6 < 10.
//6. якщо в умові true то виконується код у фігурних дужках, тобто "console.log(k)" тобто "console.log(6)".
//7. збільшується ітерація k += 1, тобто k = 6 + 1, тобто k = 7.
//8. далі перевіряється умова k < 10, тобто 7 < 10.
//9. якщо в умові true то виконується код у фігурних дужках, тобто "console.log(k)" тобто "console.log(7)".
//10. збільшується ітерація k += 1, тобто k = 7 + 1, тобто k = 8.
//11. далі перевіряється умова k < 10, тобто 8 < 10.
//12. якщо в умові true то виконується код у фігурних дужках, тобто "console.log(k)" тобто "console.log(8)".
//13. збільшується ітерація k += 1, тобто k = 8 + 1, тобто k = 9.
//14. далі перевіряється умова k < 10, тобто 9 < 10.
//15. якщо в умові true то виконується код у фігурних дужках, тобто "console.log(k)" тобто "console.log(9)".
//16. збільшується ітерація k += 1, тобто k = 9 + 1, тобто k = 10.
//17. далі перевіряється умова k < 10, тобто 10 < 10.
//18. буде false тому цикл завершується.

for (let x = 0; x < 100; x += 1) {
  if (x % 2 === 0) {
    console.log(`${x}Число парне`);
  }
}

//1. створити змінні max, min, total.
const min = 1;
const max = 9;
let total = 0;

//2. запустити цикл в діапазоні від min до max.
for (let i = min; i <= max; i += 1) {
  //3. на кожній інтерації зробити перевірку на парність числа.
  if (i % 2 === 0) {
    //4. якщо число парне додати його в total.
    console.log("парне число: ", i);
    total += i;
  }
}
for (let i = 0; i <= 10; i += 1) {
  console.log(i);
  if (i === 5) {
    console.log("Зупиняємо виконання ітерації", i);
    continue;
    console.log("Зупиняємо цикл", i);
  }
}

for (let i = 1; i <= 5; i += 2) {
  console.log(i);
}

// 2. Написати скрипт який буде перевіряти середній бал успішності учня.
// Прервати роботу циклу, коли середній бал буде меньше 7.
const minMarks = 5;
const maxMarks = 12;
for (let i = maxMarks; i >= 5; i -= 1) {
  console.log(i);
  if (i < 7) {
    console.log(i);
    break;
  }
}
